import __ from './locale';

const ErrorKeyHash = {
    1: __('请选择至少一个应用及对应信息'),
    400017101: __('访问地址类型错误。'),
    400017103: __('地址无法访问，IP不合法或网络不可达。'),
    400017104: __('请输入有效的端口号。'),
    400017005: __('参数错误。'),
    400017028: __('无效的证书类型。'),
    400017029: __('当前密钥与服务器证书不匹配。'),
    400017036: __('访问地址和端口号不能为空。'),
    500017000: __('内部错误。'),
    500017100: __('SLB服务不可用。'),
    500017020: __('hydra服务不可用。'),
    500017021: __('产品型号未设置，请联系运维人员。'),
    400017201: __('未配置第三方必填依赖'),
    400017202: __('第三方依赖信息不存在'),
    400017203: __('微服务中的依赖信息未找到'),
    // 上传
    400017204: __('上传任务不存在'),
    400017205: __('上传文件损坏'),
    400017206: __('文件类型不支持'),
    400017207: __('文件内容缺失'),
    500017008: __('当前站点未配置默认存储设备')

    
}

export default ErrorKeyHash;